tap "felixkratz/formulae"
tap "nikitabobko/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Utility that prevents the system from going to sleep
cask "caffeine"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Screenshot software
cask "flameshot"
cask "font-meslo-lg-nerd-font"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Collaboration platform for API development
cask "postman"
# Music streaming service
cask "spotify"
# Break time reminder app
cask "stretchly"
